app/controllers/casein/globals_controller.rb

SELECT  "globals".* FROM "globals"  ORDER BY title   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "globals"
---
    def index
      @casein_page_title = 'Globals'
  		@globals = Global.order(sort_order(:title)).paginate :page => params[:page]

SELECT  "globals".* FROM "globals" WHERE "globals"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
      @casein_page_title = 'View global'
      @global = Global.find params[:id]

INSERT INTO "globals" ("title", "keyword", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Project Vets"], ["keyword", ""], ["created_at", "2016-01-20 20:08:08.905583"], ["updated_at", "2016-01-20 20:08:08.905583"]]
---
    def create
      @global = Global.new global_params

      if @global.save

SELECT  "globals".* FROM "globals" WHERE "globals"."id" = $1 LIMIT 1  [["id", 1]]
---
    def update
      @casein_page_title = 'Update global'

      @global = Global.find params[:id]