app/controllers/casein/homepages_controller.rb

SELECT  "homepages".* FROM "homepages"  ORDER BY title   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "homepages"
---
    def index
      @casein_page_title = 'Homepages'
  		@homepages = Homepage.order(sort_order(:title)).paginate :page => params[:page]