app/controllers/casein/pages_controller.rb

SELECT  "pages".* FROM "pages"  ORDER BY header   LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pages"
---
    def index
      @casein_page_title = 'Pages'
  		@pages = Page.order(sort_order(:header)).paginate :page => params[:page]

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT 1  [["id", 1]]
---
    def show
      @casein_page_title = 'View page'
      @page = Page.find params[:id]

INSERT INTO "pages" ("header", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["header", "TEST"], ["content", "TEST"], ["created_at", "2016-01-20 22:23:51.666019"], ["updated_at", "2016-01-20 22:23:51.666019"]]
---
    def create
      @page = Page.new page_params

      if @page.save